"""Дополнительный модуль к игре Блиц-Викторина: переменные и константы."""

# заголовок приложения
APP_TITLE = 'ИСТОРИЧЕСКАЯ БЛИЦ-ВИКТОРИНА'

# приглашение для ввода
PROMPT = ' > '
# префикс для вывода сообщений об ошибках
ERR_PREFIX = '! '

# количество вопросов для одной игровой сессии
N = 5
# количество секунд на один вопрос
TIMER = 20

# строка с приветствием и пояснением правил игры
HELP = f"""Приветствуем в викторине по истории!
Проверьте своё знание истории России с помощью интересных вопросов.

Все вопросы имеют варианты ответов, среди них только один верный. За отведённое время ({TIMER} с) вам необходимо ввести номер варианта после приглашения для ввода и нажать клавишу Enter."""

# баллы за правильный ответ в отведённое время
CORRECT_TIME = 20
# баллы за просроченный правильный ответ
CORRECT_TIMEOUT = 10
# баллы за неправильный ответ
INCORRECT = 0

# накопленное количество баллов
SCORE = 0
