  
first = input("введите координаты первой фигуры: ")
second = input("введите координаты второй фигуры: ")

ar = "abcdefgh"
firstCoor=[0,0]
firstCoor[0] =int(first[1])-1
firstCoor[1] = ar.find(first[0])

secondCoor=[0,0]
secondCoor[0] =int(second[1])-1
secondCoor[1] = ar.find(second[0])

if not((firstCoor[0]+secondCoor[0])%2 ^ (firstCoor[1]+secondCoor[1])%2):
    print("да")
else:print("нет")

# введите координаты первой фигуры: c4
# введите координаты второй фигуры: h7
# да

# введите координаты первой фигуры: h5
# введите координаты второй фигуры: d3
# да

# введите координаты первой фигуры: a1
# введите координаты второй фигуры: a1
# да

# введите координаты первой фигуры: a1
# введите координаты второй фигуры: a2
# нет

# введите координаты первой фигуры: a1
# введите координаты второй фигуры: a3
# да