  
first = input("введите координаты первой позиции: ")
second = input("введите координаты второй позиции: ")
if first[0]==second[0] or first[1]==second[1]:
    print("да")
else: print("нет")
# введите координаты первой позиции: d4
# введите координаты второй позиции: e4
# да

# введите координаты первой позиции: a2
# введите координаты второй позиции: c4
# нет

# введите координаты первой позиции: a1
# введите координаты второй позиции: a7
# да

# введите координаты первой позиции: a1
# введите координаты второй позиции: h1
# да

# введите координаты первой позиции: a1
# введите координаты второй позиции: b2
# нет