 
first = input("введите координаты первой позиции: ")
second = input("введите координаты второй позиции: ")

ar = "abcdefgh"
firstCoor=[0,0]
firstCoor[0] =int(first[1])-1
firstCoor[1] = ar.find(first[0])

secondCoor=[0,0]
secondCoor[0] =int(second[1])-1
secondCoor[1] = ar.find(second[0])

if (-1<=(firstCoor[0]-secondCoor[0])<=1)and(-1<=(firstCoor[1]-secondCoor[1])<=1):
    print('да')
else:print('нет')

# введите координаты первой позиции: g3
# введите координаты второй позиции: f2
# да

# введите координаты первой позиции: c6
# введите координаты второй позиции: d4
# нет

# введите координаты первой позиции: d2
# введите координаты второй позиции: c3
# да

# введите координаты первой позиции: h3
# введите координаты второй позиции: g2
# да