num = int(input(" Введите целое число: "))
# ИСПРАВИТЬ: вывод не соответствует требуемому формату (лишние пробелы)
print(f""" Следующее за числом {num} число: {num+1}
 Для числа {num} предыдущее число: {num-1}""")
# КОММЕНТАРИЙ: в случае, если вы будете генерировать строку не для чтения человеком, а для другой функции/класса/программы — неверный формат может стоить вам неработающего приложения


 # Введите целое число: 42
 # Следующее за числом 42 число: 43
 # Для числа 42 предыдущее число: 41


# ИТОГ: доработать — 2/3

