from utils import game,inicialization_game

def main():
    inicialization_game()
    game()

main()

# #=============================================================================#
# #                                                                             #
# #                         ИСТОРИЧЕСКАЯ БЛИЦ-ВИКТОРИНА                         #
# #                                                                             #
# #=============================================================================#
#
# Приветствуем в викторине по истории!
# Проверьте своё знание истории России с помощью интересных вопросов.
#
# Все вопросы имеют варианты ответов, среди них только один верный. За отведённое время (20 с) вам необходимо ввести номер варианта после приглашения для ввода и нажать клавишу Enter.
#
# Когда состоялась первая киносъёмка Николая II?
# 1: В 1896 году
# 2: В 1905 году
# 3: В 1914 году
# 4: В 1917 году
#  > 3
# Неверно...
# Как назывался первый морской миноносец русского флота?
# 1: «Салют»
# 2: «Взрыв»
# 3: «Буран»
# 4: «Аврора»
#  > 2
# Верно! (1 с)
# При Иване Грозном была основана первая в России:
# 1: Корабельная верфь
# 2: Гимназия
# 3: Типография
# 4: Университет
#  > 3
# Верно! (1 с)
# В каком городе в XI веке впервые на Руси появились колокола?
# 1: В Астрахани
# 2: В Рязани
# 3: В Новгороде
# 4: В Москве
#  > 4
# Неверно...
# Как звучит фамилия первого в мире создателя практически пригодного электромагнитного телеграфа – прибора для передачи письменных сообщений по проводам?
# 1: Шиллинг
# 2: Копейка
# 3: Цент
# 4: Пенс
#  > 1
# Верно! (2 с)
# Вы набрали 60 очков
