text = input("Введите свой текст:\n")
price = 0.3 * len(text)
print(f"стоимость отправки {int(price)} руб. {round((price%1)*100)} коп.")

# Введите свой текст:
# У попа была собака он её любил, она съела кусок мяса, он её убил. И табличку написал, что У попа была собака он её любил, она съела кусок мяса, он её убил. И табличку написал, что У попа была собака он её любил, она съела кусок мяса, он её убил. И табличку написал, что У попа была собака он её любил, она съела кусок мяса, он её убил. И табличку написал, что У попа была собака он её любил, она съела кусок мяса, он её убил. И табличку написал, что
# стоимость отправки 134 руб. 70 коп.